Revit 2026 API
DirectShapeType.IsValidShape Method
Overload List
Name | Description
IsValidShape(ExternallyTaggedGeometryObject) |  Validates shape to be stored in a DirectShapeType.
IsValidShape(IList<GeometryObject>)
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType)
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace